// 倒计时
stuname = {
  542213570101: "陈晨曦",
  542213570102: "陈亲平",
  542213570103: "陈西贝",
  542213570104: "陈晓婷",
  542213570105: "崔中豪",
  542213570106: "代晓璐",
  542213570107: "董普聪",
  542213570108: "董义合",
  542213570109: "段梓萌",
  542213570111: "费婧婧",
  542213570112: "郭芷彤",
  542213570113: "韩薇",


  542213570114: "侯沛含",
  542213570115: "侯云鹤",
  542213570116: "季奥然",
  542213570117: "孔福至",
  542213570118: "寇涵冰",
  542213570119: "兰祎博",
  542213570120: "李文娟",
  542213570121: "李宇阳",
  542213570122: "刘佳兴",
  542213570123: "卢梓雨",
  542213570124: "罗聪",
  542213570125: "裴烘梽",


  542213570110: "范志鹏",
  542213570126: "乔军航",
  542213570127: "任采薇",
  542213570128: "任五州",
  542213570129: "任芷杭",
  542213570130: "邵梦雨",
  542213570131: "沈甜甜",
  542213570132: "盛云海",
  542213570133: "涂京京",
  542213570134: "万世兴",
  542213570135: "王皓泽",


  542213570137: "王晶鑫",
  542213570138: "王文霞",
  542213570139: "王旭汪",
  542213570140: "王雪莹",
  542213570141: "王妍彧",
  542213570142: "王宇萌",
  542213570143: "吴雨琳",
  542213570144: "吴语欣",
  542213570145: "徐枫林",
  542213570146: "徐皓",
  542213570147: "徐祝",
  542213570148: "杨羽",


  542213570149: "杨子又",
  542213570150: "尹丽婷",
  542213570151: "于瀚清",
  542213570152: "翟嘉乐",
  542213570153: "翟宇森",
  542213570154: "张昌博",
  542213570155: "张家惠",
  542213570156: "张姜帅",
  542213570157: "张了元",
  542213570158: "张娱嘉",
  542213570159: "赵梦婷",
  542213570160: "钟子炫",


  542201060215: "任桔明",
  542201120219: "田浩远",
  542202030115: "罗诗琪",
  542204040101: "白家好",
  542204040218: "汪梦洁",
  542206020123: "袁媛",
  542206140402: "程正恩",
  542206140501: "曹宇",
  542207290216: "王天宇"


}


let inputTime = + new Date('2024-1-1 00:00:00');
let day = document.querySelector('.day');
let hour = document.querySelector('.hour');
let minute = document.querySelector('.minute');
let second = document.querySelector('.second');
countDown();
setInterval(countDown, 1000);
function countDown() {
  let nowTime = +new Date();
  let times = (inputTime - nowTime) / 1000;
  let d = parseInt(times / 60 / 60 / 24);
  d = d < 10 ? '0' + d : d;
  let h = parseInt(times / 60 / 60 % 24);
  h = h < 10 ? '0' + h : h;
  let m = parseInt(times / 60 % 60);
  m = m < 10 ? '0' + m : m;
  let s = parseInt(times % 60);
  s = s < 10 ? '0' + s : s;
  day.innerHTML = d;
  hour.innerHTML = h;
  minute.innerHTML = m;
  second.innerHTML = s;
  // console.log(d + ":" + h + ":" + m + ":" + s);
}
document.querySelector('.box').addEventListener('click', function () {
  console.log('点了也没有效果哦')
})
document.querySelector('.btn').addEventListener('click', function () {
  let nowTime = +new Date();
  if (inputTime - nowTime > 0) {
    console.log('还没到时间哦');
  } else {
    console.log('哈哈哈哈元旦快乐');
  }
})